# SQL modification statements (exercises)

## Preparation

For this section you need `chinook.db` database file and working `%sql` magic.  
If you don't have it, please go back to the [previous section](../09_sql/connect_to_database.ipynb) and follow the instructions.  
The following code should not produce any errors:

In [18]:
%load_ext sql
%sql sqlite:///chinook.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Exercise: updating rows

In [ ]:
import sqlalchemy as sa
engine = sa.create_engine("sqlite:///chinook.db")
conn = engine.connect()
sa.inspect(engine).get_table_names()

An employee `Park Margaret` has moved to a new address: 
- `City`: `Toronto`,
- `State`: `NO`,
- `Postcode`: `M5P 2N7`. 

Update the `employee` table accordingly.  
To verify that the change indeed is made, show the content before and after the change.

In [21]:
%sql SELECT * FROM employees WHERE LastName = "Park"

Running query in 'sqlite:///chinook.db'

+------------+----------+-----------+---------------------+-----------+---------------------+---------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+--------------------------+
| EmployeeId | LastName | FirstName |        Title        | ReportsTo |      BirthDate      |       HireDate      |     Address      |   City  | State | Country | PostalCode |       Phone       |        Fax        |          Email           |
+------------+----------+-----------+---------------------+-----------+---------------------+---------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+--------------------------+
|     4      |   Park   |  Margaret | Sales Support Agent |     2     | 1947-09-19 00:00:00 | 2003-05-03 00:00:00 | 683 10 Street SW | Calgary |   AB  |  Canada |  T2P 5G3   | +1 (403) 263-4423 | +1 (403) 263-4289 | margaret@chinookcorp.com |
+------------+----------+-----------+---------------------+-----------+---------------------+---------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+--------------------------+

In [33]:
%%sql
UPDATE employees
  SET City = 'Toronto',State = 'NO',PostalCode = 'M5P 2N7'
  # WHERE LastName = 'Park',FirstName = 'Margaret'
  WHERE EmployeeId = 4
# %sql INSERT INTO employees (LastName, FirstName, City, State, PostalCode) VALUES ("Park","Margaret","Toronto","NO","M5P 2N7")

Running query in 'sqlite:///chinook.db'

1 rows affected.

++
||
++
++

In [34]:
%sql SELECT * FROM employees WHERE LastName = "Park"

Running query in 'sqlite:///chinook.db'

+------------+----------+-----------+---------------------+-----------+---------------------+---------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+--------------------------+
| EmployeeId | LastName | FirstName |        Title        | ReportsTo |      BirthDate      |       HireDate      |     Address      |   City  | State | Country | PostalCode |       Phone       |        Fax        |          Email           |
+------------+----------+-----------+---------------------+-----------+---------------------+---------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+--------------------------+
|     4      |   Park   |  Margaret | Sales Support Agent |     2     | 1947-09-19 00:00:00 | 2003-05-03 00:00:00 | 683 10 Street SW | Toronto |   NO  |  Canada |  M5P 2N7   | +1 (403) 263-4423 | +1 (403) 263-4289 | margaret@chinookcorp.com |
+------------+----------+-----------+---------------------+-----------+---------------------+---------------------+------------------+---------+-------+---------+------------+-------------------+-------------------+--------------------------+

## Exercise: adding rows

In a single SQL command insert three new random persons into the `artists` table.  
To verify that the change indeed is made, show the content before and after the change.

## Exercise: removing rows

Let's delete `artists` whose names contain the word `Santana`.  
To verify that the change indeed is made, show the content before and after the change.